app/controllers/admin/projects_controller.rb

INSERT INTO "projects" ("name", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Vancouver 1"], ["account_id", 1], ["created_at", "2018-01-06 02:21:51.868201"], ["updated_at", "2018-01-06 02:21:51.868201"]]
---
  def create
    # @project = Project.new(project_params)
    @project = @account.projects.new(project_params)

    respond_to do |format|
      if @project.save

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."account_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["account_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_project
      # @project = Project.find(params[:id])
      @project = current_user.account.projects.find(params[:id])