app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."account_id" = $1  [["account_id", 1]]
---
  def index
    @users = @account.users.all