app/controllers/accounts_controller.rb

INSERT INTO "accounts" ("name", "time_zone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["time_zone", "Hawaii"], ["created_at", "2016-05-02 20:26:44.236851"], ["updated_at", "2016-05-02 20:26:44.236851"]]
SELECT  "users".* FROM "users" WHERE "users"."account_id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["account_id", 2]]
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", "Admin"], ["updated_at", "2016-05-02 20:26:44.250535"], ["id", 3]]
INSERT INTO "projects" ("name", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "General Work"], ["account_id", 3], ["created_at", "2018-01-05 20:10:00.681045"], ["updated_at", "2018-01-05 20:10:00.681045"]]
INSERT INTO "users" ("firstName", "lastName", "email", "salt", "crypted_password", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @account = Account.new(account_params)
    # @account.users.first.role = "Admin"
    respond_to do |format|
      if @account.save
        firstUser = @account.users.first
        firstUser.update_attributes role: "Admin"
        @account.projects.create(name: "General Work")