app/controllers/dashboard_controller.rb

  def index
    @user = current_user
    # @workday = @user.workdays.first
    @workday = Workday.retrieve_current_workday(current_user)

    # TODO Need to check for current segment before creating a new one
    @work_segment = WorkSegment.retrieve_current_segment(@workday)

    @current_time = get_current_time

    @time_punch = @work_segment.timePunches.new
    # @latest_time_punch = @workday.timePunches.last
    # @time_punch_status = @latest_time_punch.clockedInStatus if @latest_time_punch
    @time_punches = TimePunch.all

    # work Segment can only have 2 punches. This pulls the last work_segment
    @current_workday_time_punches = @work_segment.timePunches.order(created_at: :desc)
---
SELECT "time_punches".* FROM "time_punches"
SELECT "time_punches".* FROM "time_punches" WHERE "time_punches"."work_segment_id" = $1 ORDER BY "time_punches"."created_at" DESC  [["work_segment_id", 11]]