app/controllers/time_punches_controller.rb

  def create
    @workSegment = @workday.workSegments.last
    puts @workSegment.workday.dayDate
    # if @workSegment.timePunches.count == 0
    #   @currentStatus = false
    # else
    #   @lastTimePunch = @workSegment.timePunches.last
    #   @currentStatus = @lastTimePunch.status
    # end
    puts("oatmeal bowl!!!")

    @time_punch = @workSegment.timePunches.create(punch: Time.current, status: true)
---
SELECT  "work_segments".* FROM "work_segments" WHERE "work_segments"."workday_id" = $1 ORDER BY "work_segments"."id" DESC LIMIT $2  [["workday_id", 2], ["LIMIT", 1]]
INSERT INTO "time_punches" ("punch", "work_segment_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["punch", "2017-06-29 18:19:23.513128"], ["work_segment_id", 10], ["status", "t"], ["created_at", "2017-06-29 18:19:23.516760"], ["updated_at", "2017-06-29 18:19:23.516760"]]

    def set_workday
      @workday = Workday.find(params[:workday_id])
---
SELECT  "workdays".* FROM "workdays" WHERE "workdays"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]