app/controllers/work_segments_controller.rb

  def index
    @work_segments = WorkSegment.all
---
SELECT "work_segments".* FROM "work_segments"

  def update
    respond_to do |format|
      if @work_segment.update(work_segment_params)
---
UPDATE "work_segments" SET "task" = $1, "project_id" = $2, "timeEntry" = $3, "updated_at" = $4 WHERE "work_segments"."id" = $5  [["task", "General Work"], ["project_id", 1], ["timeEntry", 2], ["updated_at", "2017-08-28 01:53:00.189340"], ["id", 1]]

  def destroy
    @work_segment.destroy
---
DELETE FROM "work_segments" WHERE "work_segments"."id" = $1  [["id", 5]]

    def set_work_segment
      @work_segment = WorkSegment.find(params[:id])
---
SELECT  "work_segments".* FROM "work_segments" WHERE "work_segments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]