app/controllers/workdays_controller.rb

    def set_workday
      @workday = Workday.find(params[:id])
---
SELECT  "workdays".* FROM "workdays" WHERE "workdays"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]